diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ДоговорыИРеализации</name>
    <attributes>
      <name>ВКМ_Договоры</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СоздатьДокументыРеализации(Команда)
	
	Период = Объект.ВКМ_Период;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьДокументыРеализацииНаСервере(); 
	
	Оповещение = Новый ОписаниеОповещения("СоздатьДокументыРеализацииЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);
КонецПроцедуры


&НаСервере
Функция СоздатьДокументыРеализацииНаСервере()

	ИмяМетода = "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРеализацииНаСервере";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяМетода, Объект.ВКМ_Период);

КонецФункции 

&НаКлиенте
Процедура СоздатьДокументыРеализацииЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	МассивТЧ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ЗаполнитьТЧ(МассивТЧ);
	Сообщить("Создание документов завершено");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ(МассивТЧ)
	
	ТЧ = Объект.ВКМ_ДоговорыИРеализации;
	ТЧ.Очистить();
	
	Для Каждого Элемент Из МассивТЧ Цикл 
		
		Обработки.ВКМ_МассовоеСозданиеАктов.ЗаполнитьТЧ(Элемент.Договор, Элемент.Реализация, ТЧ); 
		
	КонецЦикла;

КонецПроцедуры
